CIYOON0909/micom_stm32_emt/Core/Src/emt_app.c
/**
  ******************************************************************************
  * @file           : emt_app.c
  * @brief          :
  ******************************************************************************
  * Created on      : 21 July, 2023
  *      Author     : kimjj
  *
  ******************************************************************************
  */

#include "stdio.h"
#include "stdlib.h"
#include "string.h"
#if defined(__MICOM_BOOTLOADER__)
#else
#include "cmsis_os.h"
#endif
#include "main.h"
#include "stm32g0xx_hal.h"

#include "emt_types.h"
#include "emt_version.h"
#include "emt_app.h"
#include "emt_fw_upgrade.h"
#include "emt_led.h"
#include "emt_adc.h"
#include "emt_uart_rx.h"
#include "emt_hci.h"
#include "emt_gpio.h"
#if defined(__SUPPORT_RTC_CONTROL__)
#include "emt_rtc.h"
#endif
/* Private macro -------------------------------------------------------------*/
#if defined(__MICOM_BOOTLOADER__)
#define ENABLE_HCI_GROUP_LED
#else
#define ENABLE_HCI_GROUP_PARKING
//#define ENABLE_HCI_GROUP_GPS
#define ENABLE_HCI_GROUP_ADC
#define ENABLE_HCI_GROUP_GSENSOR
#define ENABLE_HCI_GROUP_LED

//#define ENABLE_HCI_GROUP_RADAR
#define ENABLE_HCI_GROUP_DIAGNOSTIC
#endif

#define HEX2ASCII( a ) ((a) >= 0x0A ? ((a) - 0x0A + 'A'): ((a)+'0'))
#define ASCII2HEX( a ) ((a) >= 'A' ? ((a) -'A' + 0x0A): ((a)-'0'))

#if (__TARGET_PROJECT__ == __PRIME__)
#define EDLC_VOL_4_0V					(3004)
#define EDLC_VOL_4_5V					(3377)//4.5v
#define EDLC_VOL_4_6V					(3448)//4.6V
#define EDLC_VOL_4_8V					(3595)

#define EDLC_FULL_CHARGE_COUNT			1

#define EDLC_FULL_CHARGE_VOL			EDLC_VOL_4_8V		// EDLC 완충 기준 ADC
#define EDLC_RE_CHARGE_VOL				EDLC_VOL_4_6V		// EDLC 재충전 기준 ADC
#define EDLC_OFF_ENABLE_VOL				EDLC_VOL_4_0V		// EDLC OFF 시나리오 가능한 ADC

/*12V VOL ******************************************/
#define CPU_OFF_BP_V12_ADC_MIN			(942)	//6.3V//6V	// CPU 가 OFF 되어야하는 최소 BP ADC // BP_ADC_LOWEST_VALUE_FOR_CPUOFF
#define CPU_ON_BP_V12_ADC_MIN			(1268)	// 7V	// CPU 가 ON 가능한 최소 BP ADC	// BP_ADC_LOWEST_VALUE_FOR_CPUON

#define CPU_ON_BP_10_0_V_ADC_MIN		(1723)			// EDLC 충전이 가능한 최소 BP ADC

#elif (__TARGET_PROJECT__ == __ZDR027__)
#define EDLC_VOL_4_0V					(2687)
#define EDLC_VOL_4_8V					(3225)

#define EDLC_FULL_CHARGE_VOL			EDLC_VOL_4_8V		// EDLC 완충 기준 ADC
#define EDLC_RE_CHARGE_VOL				EDLC_VOL_4_0V		// EDLC 재충전 기준 ADC
#define EDLC_OFF_ENABLE_VOL				EDLC_VOL_4_0V		// EDLC OFF 시나리오 가능한 ADC

#define EDLC_FULL_CHARGE_COUNT			30

#define BASE_TEMP_MIN					(-31)
#define BASE_TEMP_TABLE_MAX				(111)

#define CPU_OFF_BP_V12_ADC_MIN			(942) 	//	6V
#define CPU_ON_BP_V12_ADC_MIN			(1268)	//	power suply:6.9V = table:7.6V

#define CPU_ON_BP_10_0_V_ADC_MIN		(1723)

#elif (__TARGET_PROJECT__ == __ZDR_D770R__)
/*EDLC *********************************************/
#define EDLC_VOL_3_9V					(3205)
#define EDLC_VOL_4_5V					(3696)
#define EDLC_VOL_4_8V					(3940)

#define EDLC_FULL_CHARGE_VOL			EDLC_VOL_4_8V		// EDLC 완충 기준 ADC (MIN ADC)
#define EDLC_RE_CHARGE_VOL				EDLC_VOL_4_5V		// EDLC 재충전 기준 ADC (MIN ADC)
#define EDLC_OFF_ENABLE_VOL				EDLC_VOL_3_9V		// EDLC OFF 시나리오 가능한 ADC (MIN ADC)

#define EDLC_FULL_CHARGE_COUNT			1
/*12V VOL ******************************************/
#define CPU_OFF_BP_V12_ADC_MIN			(1261)	// 6.3V		// CPU 가 OFF 되어야하는 최소 BP ADC
#define CPU_ON_BP_V12_ADC_MIN			(1547)	// 7V		// CPU 가 ON 가능한 최소 BP ADC (CPU OFF 기준 ADC)

#define CPU_ON_BP_10_0_V_ADC_MIN		(2106)				// EDLC 충전이 가능한 최소 BP ADC 

#elif (__TARGET_PROJECT__ == __ZDR065__)
#if (__EMT_DEVELOP_STAGE__ == __WS__)
#define EDLC_VOL_4_0V					(2702)
#define EDLC_VOL_4_8V					(3247)
#else//ES
#define EDLC_VOL_4_0V					(3202)
#define EDLC_VOL_4_5V					(3611)//4.5v
#define EDLC_VOL_4_6V					(3694)//4.6V
#define EDLC_VOL_4_8V					(3859)
#endif

#define EDLC_FULL_CHARGE_COUNT			1

#define EDLC_FULL_CHARGE_VOL			EDLC_VOL_4_8V		// EDLC 완충 기준 ADC
#define EDLC_RE_CHARGE_VOL				EDLC_VOL_4_6V		// EDLC 재충전 기준 ADC
#define EDLC_OFF_ENABLE_VOL				EDLC_VOL_4_0V		// EDLC OFF 시나리오 가능한 ADC

/*12V VOL ******************************************/
#define CPU_OFF_BP_V12_ADC_MIN			(1194)	//6.3V//6V	// CPU 가 OFF 되어야하는 최소 BP ADC // BP_ADC_LOWEST_VALUE_FOR_CPUOFF
#define CPU_ON_BP_V12_ADC_MIN			(1540)	// 7V	// CPU 가 ON 가능한 최소 BP ADC	// BP_ADC_LOWEST_VALUE_FOR_CPUON

#define CPU_ON_BP_10_0_V_ADC_MIN		(2084)			// EDLC 충전이 가능한 최소 BP ADC

#elif (__TARGET_PROJECT__ == __LXQ2000__) || (__TARGET_PROJECT__ == __LXQ2000_CR3__)
#define EDLC_VOL_4_0V					(3255)
#define EDLC_VOL_4_8V					(3965)

#define _SYSTEM_OFF_TIME				(60)
#define _SYSTEM_OFF_TEMP				(66)    //72    //67    //70

#define BASE_TEMP_MIN					(-20)
#define BASE_TEMP_TABLE_MAX				(96)

#define BP_TYPE_V12_ADC_MAX				(4050)
#define BP_TYPE_V24_ADC_MIN				(100)

#define CPU_OFF_BP_V12_ADC_MIN			(1161)   // 6V
#define CPU_ON_BP_V12_ADC_MIN			(1391)   // 7V
#define BP_V24_ADC_MIN					(1138)
#define CPU_ON_BP_10_0_V_ADC_MIN		(2072)

#define EDLC_OFF_ENABLE_VOL				EDLC_VOL_4_0V		// EDLC OFF 시나리오 가능한 ADC
#define EDLC_FULL_CHARGE_VOL			EDLC_VOL_4_8V		// EDLC 완충 기준 ADC
#define EDLC_RE_CHARGE_VOL				EDLC_VOL_4_0V		// EDLC 재충전 기준 ADC

#define EDLC_FULL_CHARGE_COUNT			30
#elif (__TARGET_PROJECT__ == __MAGNUS__)

#define EDLC_VOL_4_3V					(3426)//min
#define EDLC_VOL_4_5V					(3669)//max

#define EDLC_VOL_4_8V					(3910) //max


#define EDLC_FULL_CHARGE_VOL			EDLC_VOL_4_8V		// EDLC 완충 기준 ADC
#define EDLC_RE_CHARGE_VOL				EDLC_VOL_4_5V		// EDLC 재충전 기준 ADC
#define EDLC_OFF_ENABLE_VOL				EDLC_VOL_4_3V		// EDLC OFF 시나리오 가능한 ADC

#define EDLC_FULL_CHARGE_COUNT			30

#define LED_PWM_DUTY_MIN				(2)
#define LED_PWM_DUTY_MAX				(27)    //(30) 30*50 = 1500
#define LED_PWM_DUTY_MIN_X5000			(4)
#define LED_PWM_DUTY_MAX_X5000			(30)    //10
#define LED_PWM_CTRL_CYCLE				(50)    //(100 - LED_PWM_DUTY_MAX)

#define _SYSTEM_OFF_TIME				(60)
#define _SYSTEM_OFF_TEMP				(66)    //72    //67    //70

#define BASE_TEMP_MIN					(-20)
#define BASE_TEMP_TABLE_MAX				(96)

#define BP_TYPE_V12_ADC_MAX				(4050)//아직 사용하지 않음.
#define BP_TYPE_V24_ADC_MIN				(100)

#define CPU_OFF_BP_V12_ADC_MIN			(1161)   // 6V
#define CPU_ON_BP_V12_ADC_MIN			(1391)   // 7V
#define BP_V24_ADC_MIN					(1138)
#define CPU_ON_BP_10_0_V_ADC_MIN		(1996)
#define CPU_ON_BP_20_0_V_ADC_MIN		0//해당 없음
#elif (__TARGET_PROJECT__ == __TRINITY__)
/**
 * EDLC 충전 중단 전압: 5.1V
 * EDLC 재충전 전압: 4.9V
 * EDLC 시나리오 Enable 전압: 4.8V
 * ES2 측정값 추가함.
 */
#define EDLC_VOL_4_0V					(2971)//(2943)
#define EDLC_VOL_4_5V					(3349)//(3317)
#define EDLC_VOL_4_6V					(3426)//(3397)
#define EDLC_VOL_4_7V 					(3498)//(3473)
#define EDLC_VOL_4_8V					(3567)//(3544) //4.8V
#define EDLC_VOL_4_9V					(3646)//(3623) //4.9V
#define EDLC_VOL_5_0V					(3723)//(3699) //5.0V
#define EDLC_VOL_5_1V					(3805)//(3768) //5.1V
#define EDLC_VOL_5_2V					(3881)//(3844) //5.2V
#define EDLC_VOL_5_3V					(3957)//()     //5.3V

// EDLC 가 얼마나 버티는지에 대한 측정을 위해 임시로
#define EDLC_FULL_CHARGE_VOL			EDLC_VOL_5_1V		// EDLC 완충 기준 ADC
#define EDLC_RE_CHARGE_VOL				EDLC_VOL_4_9V		// EDLC 재충전 기준 ADC
#define EDLC_OFF_ENABLE_VOL				EDLC_VOL_4_8V		// EDLC OFF 시나리오 가능한 ADC

#define EDLC_FULL_CHARGE_COUNT			30

#define LED_PWM_DUTY_MIN				(2)
#define LED_PWM_DUTY_MAX				(27)    //(30) 30*50 = 1500
#define LED_PWM_DUTY_MIN_X5000			(4)
#define LED_PWM_DUTY_MAX_X5000			(30)    //10
#define LED_PWM_CTRL_CYCLE				(50)    //(100 - LED_PWM_DUTY_MAX)

