CIYOON0909/micom_stm32_emt/Core/Src/emt_app.c
#define _SYSTEM_OFF_TIME				(60)
#define _SYSTEM_OFF_TEMP				(66)    //72    //67    //70

#define BASE_TEMP_MIN					(-20)
#define BASE_TEMP_TABLE_MAX				(96)

#define BP_TYPE_V12_ADC_MAX				(2024)//(2024) //~18.0V
#define BP_TYPE_V24_ADC_MIN				(2488)//(2487) //22.0V~

#define CPU_OFF_BP_V12_ADC_MIN			(719)//(659)   // 시스템 CUTOFF 전원 -> 7V 로 지정
#define CPU_ON_BP_V12_ADC_MIN			(961)//(842)   // 시스템 ON 최소 전원 -> 9V 로 지정 -> CPU ON을 기준으로한 테이블임으로 실제 CPU OFF 상태에서 부팅시 설정 전압보다 -1V 정도의 차이가 있음.
#define BP_V24_ADC_MIN					(2488)//(2487) // 우선 22V~

#define CPU_ON_BP_10_0_V_ADC_MIN		(1082)//(1084) // 우선 10V 기준 //24V에 대한 BP 최소 전압도 필요하다.
#define CPU_ON_BP_20_0_V_ADC_MIN		(2256)// 24v기준 20V 임시.
#elif (__TARGET_PROJECT__ == __CYCLOPS__)
/**
 * EDLC 충전 중단 전압: 5.0V
 * EDLC 재충전 전압: 4.5V
 * EDLC 시나리오 Enable 전압: 4.6V
 * ES2 측정값 추가함.
 */
#define EDLC_VOL_4_0V					(3251)//(2943)
#define EDLC_VOL_4_5V					(3655)//(3317)
#define EDLC_VOL_4_6V					(3737)//(3397)
#define EDLC_VOL_4_7V 					(3818)//(3473)
#define EDLC_VOL_4_8V					(3896)//(3544) //4.8V
#define EDLC_VOL_4_9V					(4979)//(3623) //4.9V
#define EDLC_VOL_5_0V					(4060)//(3699) //5.0V

// EDLC 가 얼마나 버티는지에 대한 측정을 위해 임시로
#define EDLC_FULL_CHARGE_VOL			EDLC_VOL_4_9V		// EDLC 완충 기준 ADC
#define EDLC_RE_CHARGE_VOL				EDLC_VOL_4_5V		// EDLC 재충전 기준 ADC
#define EDLC_OFF_ENABLE_VOL				EDLC_VOL_4_8V		// EDLC OFF 시나리오 가능한 ADC

#define EDLC_FULL_CHARGE_COUNT			30

#define LED_PWM_DUTY_MIN				(2)
#define LED_PWM_DUTY_MAX				(27)    //(30) 30*50 = 1500
#define LED_PWM_DUTY_MIN_X5000			(4)
#define LED_PWM_DUTY_MAX_X5000			(30)    //10
#define LED_PWM_CTRL_CYCLE				(50)    //(100 - LED_PWM_DUTY_MAX)

#define _SYSTEM_OFF_TIME				(60)
#define _SYSTEM_OFF_TEMP				(66)    //72    //67    //70

#define BASE_TEMP_MIN					(-20)
#define BASE_TEMP_TABLE_MAX				(96)

#define BP_TYPE_V12_ADC_MAX				(3897)//~18.0V
#define BP_TYPE_V12_ADC_MIN				(1000)// under 6.5v
#define BP_TYPE_V24_ADC_MIN				(1940)//18.1V ~

#define CPU_OFF_BP_V12_ADC_MIN			(1391)//(659)   // 시스템 CUTOFF 전원 -> 7.0V 로 지정
#define CPU_ON_BP_V12_ADC_MIN			(1612)//(842)  // 시스템 ON 최소 전원 -> 8V 로 지정
#define BP_V24_ADC_MIN					(1940)//(2487) // 18.1V
#define CPU_ON_BP_10_0_V_ADC_MIN		(2075)//(1084) // 우선 10V 기준 //24V에 대한 BP 최소 전압도 필요하다.
#define CPU_ON_BP_20_0_V_ADC_MIN		(2146)//20V 기준
#endif

#if (__TYPE_BP_DETECT_CHECK__ == __BP_DETECT_TYPE_GPIO__)
#define BP_DISCONNECTED_CHECK_COUNT		(3)
#else
#define BP_DISCONNECTED_CHECK_COUNT		(4)
#endif

/* Private variables ---------------------------------------------------------*/
static EMT_APP_INFO g_emt_app_info;
EMT_FW_DL_STATUS_T g_fw_dl_status = {
	.address = 0,
	.fw_packet_index = 0
};

#if (__TARGET_PROJECT__ == __ZDR027__)
const uint16_t iBaseTempadc[BASE_TEMP_TABLE_MAX + 1] =
{
	4092,	3263,	3248,	3233,	3218,	3203,	3188,	3173,	3158,	3143,	// -31, -30, -29, -28, -27, -26, -25, -24, -23, -22
	3127,	3111,	2726,	2694,	2662,	2631,	2600,	2569,	2538,	2507,	// -21, -20, -19, -18, -17, -16, -15, -14, -13, -12
	2476,	2445,	2414,	2383,	2352,	2321,	2290,	2260,	2230,	2200,	// -11, -10,  -9,  -8,  -7,  -6,  -5,  -4,  -3,  -2
	2170,	2140,	2108,	2076,	2044,	2012,	1980,	1949,	1918,	1887,	// - 1,   0,   1,   2,   3,   4,   5,   6,   7 ,  8
	1856,	1825,	1794,	1763,	1732,	1701,	1670,	1639,	1608,	1578,	//   9,  10,  11,  12,  13,  14,  15,  16,  17,  18
	1548,	1518,	1491,	1464,	1437,	1410,	1383,	1356,	1329,	1302,	//  19,  20,  21,  22,  23,  24,  25,  26,  27,  28
	1276,	1250,	1222,	1194,	1167,	1140,	1113,	1086,	1059,	1032,	//  29,  30,  31,  32,  33,  34,  35,  36,  37,  38
	1005,	978,	957,	936,	915,	894,	873,	853,	833,	813,	//  39,  40,  41,  42,  43,  44,  45,  46,  47,  48
	793,	773,	756,	739,	723,	707,	691,	675,	659,	643,	//  49,  50,  51,  52,  53,  54,  55,  56,  57,  58
	627,	611,	599,	588,	577,	566,	555,	544,	533,	522,	//  59,  60,  61,  62,  63,  64,  65,  66,  67,  68
	511,    500,	488,	476,	465,	454,	443,	433,	423,	413,	//  69,  70,  71,  72,  73,  74,  75,  76,  77,  78
	403,	393,																		//  79,  80
};
#elif (__TARGET_PROJECT__ == __LXQ2000__) || (__TARGET_PROJECT__ == __LXQ2000_CR3__)
const uint16_t iBaseTempadc[BASE_TEMP_TABLE_MAX +1] =
{
	2322, 2278, 2255, 2225, 2195, 2165, 2135, 2105, 2075, 2045,	//  -20	  -19   -18   -17   -16   -15   -14   -13   -12   -11
	2015, 1985, 1954, 1923, 1892, 1862, 1831, 1800, 1769, 1738,	//  -10    -9    -8    -7    -6    -5   -4     -3    -2    -1
	1708, 1677, 1648, 1618, 1589, 1559, 1529, 1500, 1470, 1440,	//    0     1     2     3     4     5	  6     7     8     9
	1411, 1381, 1358, 1332, 1306, 1281, 1255, 1230, 1204, 1178,	//   10    11    12    13    14    15    16    17    18    19
	1153, 1127, 1106, 1083, 1060, 1037, 1015, 992,  969,  946,	//   20    21    22    23    24    25    26    27    28    29
	923,  901,  883,  864,  845,  826,  807,  788,  769,  750,	//   30    31    32    33    34    35    36    37    38    39
	731,  712,  698,  682,  666,  650,  634,  618,  602,  586,	//   40    41    42    43    44    45    46    47    48    49
	570,  554,  543,  530,  516,  503,  490,  477,  464,  451,	//   50    51    52    53    54    55    56    57    58    59
	438,  425,  414,  402,  390,  378,  367,  355,  343,  331,	//   60    61    62    63    64    65    66    67    68    69
	320,  308,  302,  295,  287,  279,  272						//   70    71    72    73    74    75
};
#endif

/* External variables ----------------------------------------------------------*/
#if defined(__MICOM_BOOTLOADER__)
#else
extern osMessageQueueId_t	appQueueHandle;
extern osMessageQueueId_t	gSensorQueueHandle;
#endif
/* Private functions ---------------------------------------------------------*/

static void emt_app_lowpowermode(bool enable)
{
	if (enable)
	{
		if ((PWR->SR2 & PWR_SR2_REGLPF) == 0x00u)
		{
			HAL_PWREx_EnableLowPowerRunMode();
		}
	}
	else
	{
		/* If in low-power run mode at this point, exit it */
		if ((PWR->SR2 & PWR_SR2_REGLPF) != 0x00u)
		{
			if (HAL_PWREx_DisableLowPowerRunMode() != HAL_OK)
			{
				reset_mcu();
			}
		}
	}
}

void SystemClock_Config(void)
{
	RCC_OscInitTypeDef RCC_OscInitStruct = {0};
	RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
	RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

