CIYOON0909/micom_stm32_emt/Core/Src/emt_app.c
	emt_app_lowpowermode(false);
	HAL_RCC_DeInit();

	/** Configure the main internal regulator output voltage
	*/
	HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);
	/** Initializes the RCC Oscillators according to the specified parameters
	* in the RCC_OscInitTypeDef structure.
	*/
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV16;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
	RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV1;
	RCC_OscInitStruct.PLL.PLLN = 8;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	{
		Error_Handler();
	}
	/** Initializes the CPU, AHB and APB buses clocks
	*/
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
															|RCC_CLOCKTYPE_PCLK1;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
	{
		Error_Handler();
	}
	/** Initializes the peripherals clocks
	*/

	PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
	PeriphClkInit.AdcClockSelection = RCC_ADCCLKSOURCE_SYSCLK;

	if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
	{
		Error_Handler();
	}
}

void SystemClock_Config_LowPower(void)
{
	RCC_OscInitTypeDef RCC_OscInitStruct = {0};
	RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
	RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

	HAL_RCC_DeInit();

	/** Configure the main internal regulator output voltage
	*/
	HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);
	/** Initializes the RCC Oscillators according to the specified parameters
	* in the RCC_OscInitTypeDef structure.
	*/
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV8;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;

	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	{
		Error_Handler();
	}
	/** Initializes the CPU, AHB and APB buses clocks
	*/
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
								|RCC_CLOCKTYPE_PCLK1;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
	{
		Error_Handler();
	}

	PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
	PeriphClkInit.AdcClockSelection = RCC_ADCCLKSOURCE_SYSCLK;

	if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
	{
		Error_Handler();
	}

	emt_app_lowpowermode(true);
}

void emt_app_init(EMT_APP_INFO** p_emt_app_info)
{
	memset(&g_emt_app_info, 0x00, sizeof(g_emt_app_info));
	memset(&g_fw_dl_status, 0x00, sizeof(g_fw_dl_status));

	*p_emt_app_info = &g_emt_app_info;
}
#if defined(__SUPPORT_MANUAL_PARKINGMODE_CONTROL__)
bool is_manual_parking_enable_get()
{
	return g_emt_app_info.is_parking_manual_enable;
}

bool is_parking_acc_get()
{
	return g_emt_app_info.is_parking_manual_set;
}
#endif

#if defined(__MICOM_BOOTLOADER__)
#else
void emt_app_jump_to_bootloader(void)
{
	extern uint8_t __flash_bootloader_addr;
	uint32_t bootloader_addr = (uint32_t)&__flash_bootloader_addr;

	typedef  void (*pFunction)(void);
	pFunction Jump_To_Application;
	uint32_t JumpAddress;

	emt_led_process_timer_deinit();
	HAL_Delay(10);
	emt_fw_upgrade_save_newfw_magic_number_to_ram();
	emt_uart_deinit();
	emt_adc_deinit();
	emt_front_led_deinit();
	emt_status_led_deinit();
	HAL_RCC_DeInit();
	//HAL_DeInit();

	SysTick->CTRL = 0;
	SysTick->LOAD = 0;
	SysTick->VAL = 0;

	__disable_irq(); // disable interrupt
	__set_PRIMASK(1);

	for (int i=0;i<5;i++)
	{
		NVIC->ICER[i]=0xFFFFFFFF;
		NVIC->ICPR[i]=0xFFFFFFFF;
	}
	__HAL_REMAPMEMORY_SYSTEMFLASH();
	__HAL_RCC_APB1_FORCE_RESET();
	__HAL_RCC_APB1_RELEASE_RESET();
	__HAL_RCC_APB2_FORCE_RESET();
	__HAL_RCC_APB2_RELEASE_RESET();
	__HAL_RCC_AHB_FORCE_RESET();
	__HAL_RCC_AHB_RELEASE_RESET();
	/* Jump to user application */
	JumpAddress = *(__IO uint32_t*) (bootloader_addr + 4);
	Jump_To_Application = (pFunction) JumpAddress;
	/* Initialize user application's Stack Pointer */
//					__set_MSP(*(__IO uint32_t*) FLASH_BOOT_START_ADDR);
	__ASM volatile ("movs r3, #0\nldr r3, [r3, #0]\nMSR msp, r3\n" : : : "r3", "sp");
	Jump_To_Application();

	while(1);
}


void emt_app_check_cut_off_process(EMT_APP_INFO *p_emt_app_info)
{
#if (__TYPE_BB_SCENARIO__ == __BB_FINE__) //|| (__TYPE_BB_SCENARIO__ == __BB_DOMESTIC__)
	uint16_t bp_adc_value = 0;

	if((p_emt_app_info->system_power_mode != EMT_CPU_POWER_ON)
		&& (p_emt_app_info->bbx_op_mode < EMT_BBX_OP_CUT_OFF_MODE)
		&& (p_emt_app_info->cpu_cutoff.on == true))
	{
		if(p_emt_app_info->bp_type == EMT_BP_TYPE_V12)
		{
			bp_adc_value = p_emt_app_info->adc_value.bp_v12;
		}
		else
		{
			bp_adc_value = p_emt_app_info->adc_value.bp_v24;
		}

		if((p_emt_app_info->cpu_cutoff.check_adc != 0) && (p_emt_app_info->cpu_cutoff.check_adc > bp_adc_value))
		{
			p_emt_app_info->cpu_cutoff.check_count++;
			if(p_emt_app_info->cpu_cutoff.check_count == 60)
			{
				EMT_MSGQUEUE_T msg;
				msg.command = EMT_MSG_SET_CPU_POWER_DOWN;
				msg.data_len = 1;
				msg.data[0] = EMT_BBX_OP_CUT_OFF_MODE;
				osMessageQueuePut (appQueueHandle, &msg, 0, 0);
				p_emt_app_info->cpu_cutoff.on = false;
				//p_emt_app_info->cpu_cutoff.check_count = 0;
				//p_emt_app_info->cpu_cutoff.check_adc = 0;
			}
		}
		else
		{
			p_emt_app_info->cpu_cutoff.check_count = 0;
		}
	}
#endif
}

void emt_app_check_temperature(EMT_APP_INFO* p_emt_app_info)
{
#if defined (__SUPPORT_TEMP_ADC_CONVERT__)
	EMT_TEMPERATURE_STRUCT_T*  p_temperature = &p_emt_app_info->temperature;
	uint16_t tempADC = p_emt_app_info->adc_value.temperature;
	int i;

	const uint16_t *pTempTable = NULL;

	p_temperature->value = BASE_TEMP_MIN;
	pTempTable = iBaseTempadc;

	if(tempADC < pTempTable[0])
	{
		for(i = 0; i < BASE_TEMP_TABLE_MAX; i++)
		{
			if((tempADC <= pTempTable[i]) && (tempADC >= pTempTable[i+1] +1))
				break;

			p_temperature->value += 1;
		}
	}

