CIYOON0909/micom_stm32_emt/Core/Src/emt_app.c
#if (__TYPE_BB_SCENARIO__ == __BB_FINE__)
	if(p_emt_app_info->system_power_mode != EMT_CPU_POWER_ON)
	{
		if(p_temperature->value >= _SYSTEM_OFF_TEMP)
		{
			p_temperature->check_count++;
		}
		else
		{
			p_temperature->check_count = 0;
		}

		if(p_temperature->check_count >= 60)
		{
			EMT_MSGQUEUE_T msg;
			//TODO : CPU Power Up and Last Record
			msg.command = EMT_MSG_SET_CPU_POWER_UP;
			msg.data_len = 1;
			msg.data[0] = EMT_BBX_OP_CUT_OFF_MODE;
			osMessageQueuePut (appQueueHandle, &msg, 0, 0);
		}
	}
#endif
#endif //#if defined (__SUPPORT_TEMP_ADC_CONVERT__)
}

bool emt_app_is_bp_cutoff(EMT_APP_INFO* p_emt_app_info)
{
	bool value = false;
#if (__TYPE_BP_DETECT_CHECK__ == __BP_DETECT_TYPE_GPIO__)
#else
	if(p_emt_app_info->system_power_mode == EMT_CPU_POWER_ON)
	{
		#if (__TARGET_PROJECT__ == __TRINITY__)
		if(p_emt_app_info->adc_value.bp_v12 < CPU_OFF_BP_V12_ADC_MIN) /*&& (p_emt_app_info->adc_value.bp_v24 < BP_V24_ADC_MIN)*/
		{
			value = true;
		}
		#if 0 //2025.05.14 [arkyoung] 테스트용이니 우선 주석 처리
		//about 24v
		else if ( p_emt_app_info->adc_value.bp_v12 > BP_TYPE_V12_ADC_MAX && p_emt_app_info->adc_value.bp_v12 < BP_TYPE_V24_ADC_MIN)
		{
			value = true;
		}
		#endif
		#else
		if(p_emt_app_info->adc_value.bp_v12 < CPU_OFF_BP_V12_ADC_MIN) /*&& (p_emt_app_info->adc_value.bp_v24 < BP_V24_ADC_MIN)*/
		{
			value = true;
		}
		#endif
	}
	else
	{
		if(p_emt_app_info->adc_value.bp_v12 < CPU_ON_BP_V12_ADC_MIN) /*&& (p_emt_app_info->adc_value.bp_v24 < BP_V24_ADC_MIN)*/
		{
			value = true;
		}
	}
#endif
	return value;
}

static bool emt_app_check_bp_detect(EMT_APP_INFO* p_emt_app_info)
{
	bool val = true; 

#if (__TYPE_BP_DETECT_CHECK__ == __BP_DETECT_TYPE_ADC__)
	if( emt_app_is_bp_cutoff(p_emt_app_info) == true)
#elif (__TYPE_BP_DETECT_CHECK__ == __BP_DETECT_TYPE_GPIO__)
	if( emt_gpio_is_bp_detect() == false )
#endif
	{
		p_emt_app_info->bp.remove_check_count++;
		if(p_emt_app_info->bp.remove_check_count >= BP_DISCONNECTED_CHECK_COUNT)
		{
			p_emt_app_info->bp.remove_check_count = BP_DISCONNECTED_CHECK_COUNT;
			val = false;
		#if (__TYPE_BP_DETECT_CHECK__ == __BP_DETECT_TYPE_GPIO__)
			HAL_Delay(20);
			if( emt_gpio_is_bp_detect() == true )	val = true; // 재 확인 필요. jhpark
		#endif
		}
	}
	else
	{
		p_emt_app_info->edlc.last_edlc = p_emt_app_info->adc_value.edlc;
		p_emt_app_info->bp.remove_check_count = 0;
	}

	return val;
}

static void emt_app_edlc_power_off_process(EMT_APP_INFO* p_emt_app_info)
{
	EMT_MSGQUEUE_T msg;

	if((p_emt_app_info->system_power_mode == EMT_CPU_POWER_ON) && (p_emt_app_info->bp.cpu_off_wait == false))
	{
		if(p_emt_app_info->edlc.charge_process_enable == true)
		{
			if(p_emt_app_info->edlc.last_edlc >= EDLC_OFF_ENABLE_VOL)
			{
				msg.command = EMT_MSG_BP_OFF;
				msg.data_len = 0;
				osMessageQueuePut (appQueueHandle, &msg, 0, 0);
			}
			else
			{
				msg.command = EMT_MSG_SET_CPU_POWER_DOWN;
				msg.data_len = 1;
				msg.data[0] = EMT_BBX_OP_CUT_OFF_MODE;
				osMessageQueuePut (appQueueHandle, &msg, 0, 0);
			}
		}
		else
		{
			msg.command = EMT_MSG_SET_CPU_POWER_DOWN;
			msg.data_len = 1;
			msg.data[0] = EMT_BBX_OP_CUT_OFF_MODE;
			osMessageQueuePut (appQueueHandle, &msg, 0, 0);
		}
	}
}

static void emt_app_edlc_charging_process(EMT_APP_INFO* p_emt_app_info)
{
	uint32_t offset_cnt = 20;//50MS 타이머 기준 1초 offset

	// switch (timer_type)
	// {
	// case OS_TIMER_50MS:	offset_cnt = 20;	break;//__BB_COMTEC__
	// case OS_TIMER_250MS:	offset_cnt = 4;		break;//__BB_FINE__
	// default:				offset_cnt = 20;	break;//50ms
	// }

	if(p_emt_app_info->edlc.charge_process_enable == true)
	{
#if 0
		if(p_emt_app_info->edlc.last_edlc >= EDLC_OFF_ENABLE_VOL)
		{
			emt_gpio_micom_power_en(EMT_ON);
		}
		else
		{
			emt_gpio_micom_power_en(EMT_OFF);
		}
#endif
		if(p_emt_app_info->edlc.charging_start_delay_count < (5 * offset_cnt))	//5s
		{	/* 녹화 시작 (EMT_HCI_CID_SYSTEM_READY) 후 N초 이후부터 edlc 충전하도록 함. (소모전류 1A) */
			p_emt_app_info->edlc.charging_start_delay_count++;
			return;
		}
		p_emt_app_info->edlc.charging_start_delay_count = (5 * offset_cnt);
		
		if(p_emt_app_info->bp_type == EMT_BP_TYPE_V12 && \
				p_emt_app_info->adc_value.bp_v12 < CPU_ON_BP_10_0_V_ADC_MIN)
		{
			if(p_emt_app_info->edlc.charging_on == true)
			{
				p_emt_app_info->edlc.low_level_count = 0;
				p_emt_app_info->edlc.high_level_count = 0;
				emt_gpio_set_edlc_ctrl(false);
			}
		}
#if defined(__SUPPORT_24V_ADC_CHANNEL__)
		else if(p_emt_app_info->bp_type == EMT_BP_TYPE_V24 && \
				p_emt_app_info->adc_value.bp_v24 < CPU_ON_BP_20_0_V_ADC_MIN)
		{
			if(p_emt_app_info->edlc.charging_on == true)
			{
				p_emt_app_info->edlc.low_level_count = 0;
				p_emt_app_info->edlc.high_level_count = 0;
				emt_gpio_set_edlc_ctrl(false);
			}
		}
#else
		else if(p_emt_app_info->bp_type == EMT_BP_TYPE_V24 && \
				p_emt_app_info->adc_value.bp_v12 < CPU_ON_BP_20_0_V_ADC_MIN)
		{
			if(p_emt_app_info->edlc.charging_on == true)
			{
				p_emt_app_info->edlc.low_level_count = 0;
				p_emt_app_info->edlc.high_level_count = 0;
				emt_gpio_set_edlc_ctrl(false);
			}
		}
#endif
		else if(p_emt_app_info->edlc.temperature_warning_on == true)
		{
			if(p_emt_app_info->edlc.charging_on == true)
			{
				p_emt_app_info->edlc.low_level_count = 0;
				p_emt_app_info->edlc.high_level_count = 0;
				emt_gpio_set_edlc_ctrl(false);
			}
		}
		else
		{
			if(p_emt_app_info->adc_value.edlc >= EDLC_FULL_CHARGE_VOL)
			{
				if(p_emt_app_info->edlc.high_level_count >= (EDLC_FULL_CHARGE_COUNT * offset_cnt)) //over EDLC_FULL_CHARGE_COUNT seconds edlc charging
				{
					p_emt_app_info->edlc.charging_on = false;
				}
				else
				{
					if(p_emt_app_info->edlc.charging_on == true)
					{
						p_emt_app_info->edlc.high_level_count++;
					}
				}
			}
			else if(p_emt_app_info->adc_value.edlc < EDLC_RE_CHARGE_VOL) // edlc low level, charging start
			{
				p_emt_app_info->edlc.low_level_count = 0;
				p_emt_app_info->edlc.high_level_count = 0;
				p_emt_app_info->edlc.charging_on = true;
			}
			else
			{
				if(p_emt_app_info->edlc.charging_on == true)
				{
					p_emt_app_info->edlc.low_level_count++;
					if(p_emt_app_info->edlc.low_level_count > (90 * offset_cnt)) //control over charging
					{
						p_emt_app_info->edlc.low_level_count = 0;
						p_emt_app_info->edlc.charging_on = false;
					}
				}
			}
			emt_gpio_set_edlc_ctrl(p_emt_app_info->edlc.charging_on);
		}
	}
}

void emt_app_edlc_process(EMT_APP_INFO* p_emt_app_info)
{
	bool	bp_detect;

	bp_detect = emt_app_check_bp_detect(p_emt_app_info);

	if(p_emt_app_info->system_power_mode == EMT_CPU_POWER_ON)
	{
		if(bp_detect == false)
		{
			emt_app_edlc_power_off_process(p_emt_app_info);
			p_emt_app_info->edlc.charge_process_enable = false;
			p_emt_app_info->edlc.charging_on = false;
			emt_gpio_set_edlc_ctrl(p_emt_app_info->edlc.charging_on);
		}
		else
		{
			emt_app_edlc_charging_process(p_emt_app_info);
		}
	}
	else
	{
		p_emt_app_info->edlc.last_edlc = 0;
		if(bp_detect == false)
		{
			emt_led_set_status_led(EMT_APP_STATUS_LED_OFF);
			p_emt_app_info->temperature.waiting_acc_on = false;
		}
	}
}

void emt_app_check_acc_status(EMT_APP_INFO *p_emt_app_info)
{
	if(emt_gpio_is_acc_detect())
	{
		p_emt_app_info->acc.on_check_count++;
		p_emt_app_info->acc.off_check_count = 0;

		if(p_emt_app_info->acc.on_check_count == 4)
		{
			if(p_emt_app_info->acc.on == false)
			{
				p_emt_app_info->temperature.waiting_acc_on = false;
			}

			p_emt_app_info->acc.on_check_count = 0;
			p_emt_app_info->acc.on = true;
			p_emt_app_info->cpu_watchdog.working_check_count = 0;
		}
	}
	else
	{
		p_emt_app_info->acc.on_check_count = 0;
		p_emt_app_info->acc.off_check_count++;

		if(p_emt_app_info->acc.off_check_count == 4)
		{
			p_emt_app_info->acc.off_check_count = 0;
			p_emt_app_info->acc.on = false;
		}
	}
}
#if (__TYPE_BB_SCENARIO__ == __BB_COMTEC__) || (__TYPE_BB_SCENARIO__ == __BB_DOMESTIC__)
void emt_gpio_set_aqs_status(EMT_APP_INFO *p_emt_app_info)
{
	if(emt_gpio_is_acc_detect())
	{
		emt_gpio_set_aqs_mode(_AQS_BOOT_NORMAL);
	}
	else
	{
		if(p_emt_app_info->bbx_op_mode == EMT_BBX_OP_PARKING_AQS_MODE)
		{
			emt_gpio_set_aqs_mode(_AQS_BOOT_BDF);
		}
		else
		{
			if(p_emt_app_info->is_parking_rec_enable == true)
			{
				emt_gpio_set_aqs_mode(_AQS_BOOT_PARKING);
			}
			else
			{
				emt_gpio_set_aqs_mode(_AQS_BOOT_PARK_REC_OFF);
			}
		}
	}
}
#endif

