CIYOON0909/micom_stm32_emt/Core/Src/emt_app.c
EMT_BP_TYPE emt_app_get_bp_type(EMT_ADC_STRUCT_T *p_adc_value)
{
	EMT_BP_TYPE bp_type = EMT_BP_TYPE_V12;
//전원 사양 확인 후 적용 필요.
#if defined(__SUPPORT_24V_ADC_CHANNEL__)
#if (__TARGET_PROJECT__ == __CYCLOPS__)
	if (p_adc_value->bp_v12 < BP_TYPE_V12_ADC_MIN || p_adc_value->bp_v12 > BP_TYPE_V12_ADC_MAX)
	{
		if(p_adc_value->bp_v24 > BP_TYPE_V24_ADC_MIN)
		{
			bp_type = EMT_BP_TYPE_V24;
		}
	}
#else
	if (p_adc_value->bp_v12 > BP_TYPE_V12_ADC_MAX)
	{
		if(p_adc_value->bp_v24 > BP_TYPE_V24_ADC_MIN)
		{
			bp_type = EMT_BP_TYPE_V24;
		}
	}
#endif
#else
#if (__TARGET_PROJECT__ == __TRINITY__)
	if(p_adc_value->bp_v12 > BP_TYPE_V12_ADC_MAX)
	{
		{
			bp_type = EMT_BP_TYPE_V24;
		}
	}
#endif
#endif
	return bp_type;
}
#endif

static void emt_app_cpu_hci_cmd_proc_system_group(EMT_HCI_PACKET_MSG *p_hci_msg)
{
	switch(p_hci_msg->cid)
	{
	case EMT_HCI_CID_FW_VERSION://CMD_C2M_CPU_VERSION_ACK
		{
			if(p_hci_msg->payload[0] == 0)	//CPU 에서 ACC ON 판단.
			{
				if(g_emt_app_info.bbx_op_mode != EMT_BBX_OP_NORMAL_MODE)
				{
					g_emt_app_info.bbx_op_mode = EMT_BBX_OP_NORMAL_MODE;
				}
			}

			p_hci_msg->payload_length = 0;
			p_hci_msg->payload[p_hci_msg->payload_length++] = EMT_MICOM_VERSION_CHAR;
			p_hci_msg->payload[p_hci_msg->payload_length++] = EMT_MICOM_VERSION_MAJOR;
			p_hci_msg->payload[p_hci_msg->payload_length++] = '.';
			p_hci_msg->payload[p_hci_msg->payload_length++] = EMT_MICOM_VERSION_MINOR;
			p_hci_msg->payload[p_hci_msg->payload_length++] = '.';
			p_hci_msg->payload[p_hci_msg->payload_length++] = EMT_MICOM_VERSION_REVISOIN;
			p_hci_msg->payload[p_hci_msg->payload_length++] = '_';
			p_hci_msg->payload[p_hci_msg->payload_length++] = EMT_MICOM_VERSION_HIDDEN;
		#if defined(__SUPPORT_SEND_RESETTYPE_TO_CPU__)
			p_hci_msg->payload[p_hci_msg->payload_length++] = g_emt_app_info.cpu_reset_type;
		#endif
		}
		break;
	case EMT_HCI_CID_WATCHDOG_CLEAR:
		break;
	case EMT_HCI_CID_WATCHDOG_CONFIG:
		{
			if(p_hci_msg->payload[0] == 0)
			{
				g_emt_app_info.cpu_watchdog.mode = EMT_CPU_WATCHDOG_OFF;
			}
			else
			{
				g_emt_app_info.cpu_watchdog.mode = EMT_CPU_WATCHDOG_WORKING_CHECK;
			}
		}
		break;
#if defined(__MICOM_BOOTLOADER__)
#else
	case EMT_HCI_CID_SYSTEM_READY:
		{
			g_emt_app_info.edlc.charging_on = true;
			g_emt_app_info.edlc.charge_process_enable = true;
			emt_gpio_micom_power_en(EMT_ON);
		}
		break;

	case EMT_HCI_CID_TEMPERATURE_WARNING:
		{
			g_emt_app_info.edlc.temperature_warning_on = p_hci_msg->payload[0];
		}
		break;
	case EMT_HCI_CID_CPU_POWER_OFF:
		{
			EMT_MSGQUEUE_T msg;
			switch (p_hci_msg->payload[0])
			{
			case EMT_APP_CPU_POWER_OFF_SUSPEND:
				msg.data[0] = EMT_BBX_OP_CUT_OFF_MODE;
				break;
			case EMT_APP_CPU_POWER_OFF_TEMPOFF:
				msg.data[0] = EMT_BBX_OP_CUT_OFF_HIGH_TEMP_MODE;
				break;
			case EMT_APP_CPU_POWER_OFF_AI_TEMPOFF:
				msg.data[0] = EMT_BBX_OP_CUT_OFF_HIGH_TEMP_AI_MODE;
				break;
			case EMT_APP_CPU_POWER_OFF_BDF:
				{
					if(g_emt_app_info.bbx_op_mode == EMT_BBX_OP_PARKING_AQS_MODE)
					{ /*하차캔슬 초기화 되지 않도록 함.*/
						g_emt_app_info.aqs.delay_count = 1;
					}
					else
					{	/*
						*  When the value of 'delay_time' is 0, the CPU enters the AQS mode
						* after 5 seconds while the parkingaqs value of the HW_TEST mode is active.
						*/
						if (g_emt_app_info.aqs.delay_time == 0)
						{
							g_emt_app_info.aqs.delay_count = 5;
						}
						else
						{
							g_emt_app_info.aqs.delay_count = g_emt_app_info.aqs.delay_time * 60;
						}
					}
					msg.data[0] = EMT_BBX_OP_PARKING_AQS_MODE;
				}
				break;
			case EMT_APP_CPU_POWER_OFF_AI_PARKING:
				g_emt_app_info.aqs.delay_count = g_emt_app_info.aqs.delay_time;
				msg.data[0] = EMT_BBX_OP_PARKING_AI_LOW_PWR_MODE;
				break;
			default: /*if(p_hci_msg->payload[0] == EMT_APP_CPU_POWER_OFF)*/
				msg.data[0] = EMT_BBX_OP_SYSTEM_OFF_MODE;
				break;
			}

			msg.command = EMT_MSG_SET_CPU_POWER_DOWN;
			msg.data_len = 1;
			osMessageQueuePut (appQueueHandle, &msg, 0, 0);
		}
		break;
#endif
	case EMT_HCI_CID_CPU_POWER_RESET:
		{
	#if defined(__MICOM_BOOTLOADER__)
	#else
			EMT_MSGQUEUE_T msg;
		#if defined(__SUPPORT_SEND_RESETTYPE_TO_CPU__)
			g_emt_app_info.cpu_reset_type = 0;
		#endif
			switch (p_hci_msg->payload[0])
			{
			case EMT_APP_CPU_POWER_RESET_NORMAL_TO_PARKING:	msg.data[0] = EMT_BBX_OP_PARKING_NORMAL_MODE;	break;
			case EMT_APP_CPU_POWER_RESET_PARKING_TO_NORMAL:	msg.data[0] = EMT_BBX_OP_NORMAL_MODE;			break;
			case EMT_APP_CPU_POWER_RESET_AI_PARKING:		msg.data[0] = EMT_BBX_OP_PARKING_AI_MODE;		break;
			default: 										msg.data[0] = g_emt_app_info.bbx_op_mode;		break;//EMT_APP_CPU_POWER_RESET
			}
			g_emt_app_info.need_cpu_acc_check = true;
		#if defined(__SUPPORT_SEND_RESETTYPE_TO_CPU__)
			g_emt_app_info.cpu_reset_type = p_hci_msg->payload[1];
		#endif
			msg.command = EMT_MSG_SET_CPU_RESET;
			msg.data_len = 1;
			osMessageQueuePut (appQueueHandle, &msg, 0, 0);
			g_emt_app_info.bbx_communication_on = false;
	#endif
		}
		break;
	case EMT_HCI_CID_MICOM_RESET_CPU_DCDC_OFF:
		{
			emt_status_led_control(EMT_APP_STATUS_LED_OFF);
			emt_uart_deinit();
			emt_led_process_timer_deinit();
			emt_front_led_deinit();
			emt_status_led_deinit();
			emt_gpio_cpu_powerctrl(EMT_CPU_POWER_OFF);
			HAL_Delay(50);
			emt_gpio_mcu_reset();
		}
		break;
	case EMT_HCI_CID_PERIODIC_DATA_ENABLE:
		{
			g_emt_app_info.periodic_data_mode = p_hci_msg->payload[0];
		}
		break;
#if defined(__SUPPORT_RTC_CONTROL__)
	case EMT_HCI_CID_RTC_TIME_GET:
		{
			if(g_emt_app_info.is_rtc_lost == true)
			{
				p_hci_msg->payload[0] = g_emt_app_info.is_rtc_lost;
				p_hci_msg->payload_length = 1;
				g_emt_app_info.is_rtc_lost = false;
			}
			else
			{
				EMT_HCI_RTC_INFO rtc_info;
				rtc_info.status = emt_rtc_read_time((emt_rtc_t *)rtc_info.time);

				memcpy(&p_hci_msg->payload[0], &rtc_info, sizeof(EMT_HCI_RTC_INFO));
				p_hci_msg->payload_length = sizeof(EMT_HCI_RTC_INFO);
			}
		}
		break;
	case EMT_HCI_CID_RTC_TIME_SET:
		{
			EMT_HCI_RTC_INFO rtc_info;
			//rtc set
			memcpy(rtc_info.time, p_hci_msg->payload, sizeof(emt_rtc_t));
			rtc_info.status = emt_rtc_set_time((emt_rtc_t *)rtc_info.time);

			//rtc set result send
			memcpy(&p_hci_msg->payload[0], &rtc_info, sizeof(EMT_HCI_RTC_INFO));
			p_hci_msg->payload_length = sizeof(EMT_HCI_RTC_INFO);
		}
		break;
#endif
	default:
		break;
	}
}

