CIYOON0909/micom_stm32_emt/Core/Src/emt_app.c
#if defined(ENABLE_HCI_GROUP_PARKING)
static void emt_app_cpu_hci_cmd_proc_parking_group(EMT_HCI_PACKET_MSG *p_hci_msg)
{
	switch(p_hci_msg->cid)
	{
	case EMT_HCI_CID_PARKING_EVENT_IGNORE_TIME:
		{
			// g_emt_app_info.aqs.delay_time = *((int16_t *)p_hci_msg->payload);
			memcpy(&g_emt_app_info.aqs.delay_time,p_hci_msg->payload,sizeof(int8_t));
		}
		break;
	case EMT_HCI_CID_PARKING_QUICK_PRESSED:
		{
			p_hci_msg->payload[0] = g_emt_app_info.is_key_easy_btn_on;
			p_hci_msg->payload_length = 1;
		}
		break;
	case EMT_HCI_CID_PARKING_CUT_OFF_VOL:
		{
			memcpy(&g_emt_app_info.cpu_cutoff.check_adc,p_hci_msg->payload,sizeof(int32_t));
			// g_emt_app_info.cpu_cutoff.check_adc = *((int32_t*)p_hci_msg->payload);

			g_emt_app_info.cpu_cutoff.check_count = 0;
			g_emt_app_info.cpu_cutoff.on = true;
		}
		break;
	case EMT_HCI_CID_PARKING_REC_ENABLE_SET:
		{	/* ZDR055 단말기 기준 ACC ON<->OFF 빠르게 전환 시 주차녹화 동작 싱크 맞추기위해 사용.
		 	 *  SiliconLaps							STM32
			 *  CMD_C2M_SET_TEMPPARKINGONOFF	==	EMT_HCI_CID_PARKING_REC_ENABLE_SET
			 *  g_byQuick_pressed				==	g_emt_app_info.is_parking_rec_enable
		  	 */
			g_emt_app_info.is_parking_rec_enable = p_hci_msg->payload[0];
		}
		break;

#if defined(__SUPPORT_MANUAL_PARKINGMODE_CONTROL__)
	case EMT_HCI_CID_PARKING_MANUAL_ENABLE_SET:
		{
			g_emt_app_info.is_parking_manual_enable = p_hci_msg->payload[0];
		}
		break;
	case EMT_HCI_CID_PARKING_MANUAL_ACC_SET:
		{
			g_emt_app_info.is_parking_manual_set = p_hci_msg->payload[0];
		}
		break;
#endif
	default:
		break;
	}
}
#endif

#if defined(ENABLE_HCI_GROUP_GPS)
static void emt_app_cpu_hci_cmd_proc_gps_group(EMT_HCI_PACKET_MSG *p_hci_msg)
{
	switch(p_hci_msg->cid)
	{
		case EMT_HCI_CID_GPS_RESET:
			break;
		case EMT_HCI_CID_GPS_CONFIG:
			break;
		case EMT_HCI_CID_GPS_MSG_PVT:
			break;
		case EMT_HCI_CID_GPS_MSG_SAT:
			break;
		case EMT_HCI_CID_GPS_MSG_RAW:
			break;
		case EMT_HCI_CID_GPS_SET_MSG:
			break;
		default:
			break;
	}
}
#endif

#if defined(ENABLE_HCI_GROUP_ADC)
static void emt_app_cpu_hci_cmd_proc_adc_group(EMT_HCI_PACKET_MSG *p_hci_msg)
{
	switch(p_hci_msg->cid)
	{
		default:
			break;
	}
}
#endif

#if defined(ENABLE_HCI_GROUP_GSENSOR)
static void emt_app_cpu_hci_cmd_proc_gsensor_group(EMT_HCI_PACKET_MSG *p_hci_msg)
{
	switch(p_hci_msg->cid)
	{
	case EMT_HCI_CID_GSENSOR_SENSITIVIY_DATA:
		{
		#if (__TYPE_G_SENSOR_PROC_MODE__ == __G_SENSOR_DATA_RECV_MODE__)
			if(p_hci_msg->payload_length > 0)
			{
				EMT_MSGQUEUE_T msg;
				msg.command = EMT_MSG_GSENSOR_SET_SENSITIVITY;
				memcpy((void*)&msg.data[0], (void*)p_hci_msg->payload, sizeof(EMT_GSENSOR_VALUE_T));
				msg.data_len = sizeof(EMT_GSENSOR_VALUE_T);
				osMessageQueuePut (gSensorQueueHandle, &msg, 0, 0);
			}
		#endif
		}
		break;
	case EMT_HCI_CID_GSENSOR_PERIOD:
		break;
	default:
		break;
	}
}
#endif

#if defined(ENABLE_HCI_GROUP_LED)
static void emt_app_cpu_hci_cmd_proc_led_group(EMT_HCI_PACKET_MSG *p_hci_msg)
{
	switch(p_hci_msg->cid)
	{
	case EMT_HCI_CID_LED_PATTEN:
		{
			EMT_STATUS_LED_TYPE status_led_type = EMT_APP_STATUS_LED_OFF;
			#if (__TARGET_PROJECT__ == __TRINITY__) || (__TARGET_PROJECT__ == __CYCLOPS__)
			if ( p_hci_msg->payload_length == sizeof(uint16_t) ) 
			{
				memcpy(&status_led_type, p_hci_msg->payload, sizeof(uint16_t));
			}
			else
			{
				status_led_type = (EMT_STATUS_LED_TYPE)p_hci_msg->payload[0];
			}
			#else
			status_led_type = (EMT_STATUS_LED_TYPE)p_hci_msg->payload[0];
			#endif
			
			emt_led_set_status_led(status_led_type);
		}
		break;
	case EMT_HCI_CID_FRONT_LED_PWM:
		{
			EMT_FRONT_LED_TYPE front_led_type = (EMT_FRONT_LED_TYPE)p_hci_msg->payload[0];
			if(front_led_type < EMT_APP_FRONT_LED_MAX)
			{
				emt_led_set_front_led(front_led_type);
			}
		}
		break;
#if (__TARGET_PROJECT__ == __TRINITY__) || (__TARGET_PROJECT__ == __CYCLOPS__)
    //led test mode
	#if !defined(__MICOM_BOOTLOADER__)	
	case EMT_HCI_CID_LED_SET_RGB_INFO:
	{
		EMT_STATUS_LED_RGB_INFO *p_rgb_info = (EMT_STATUS_LED_RGB_INFO*)&p_hci_msg->payload[0];

		emt_status_led_rgb_test(p_rgb_info);
		break;
	}
	#endif
#endif
	default:
		break;
	}
}
#endif

#if defined(ENABLE_HCI_GROUP_RADAR)
static void emt_app_cpu_hci_cmd_proc_radar_group(EMT_HCI_PACKET_MSG *p_hci_msg)
{
	switch(p_hci_msg->cid)
	{
	case EMT_HCI_CID_RADAR_RESERVED1:
		break;
	default:
		break;
	}
}
#endif

static void emt_app_cpu_hci_cmd_proc_fw_update_group(EMT_HCI_PACKET_MSG *p_hci_msg)
{
	int32_t ret;
	switch(p_hci_msg->cid)
	{
	case EMT_HCI_CID_ENTER_BOOTLOADER:
		{
			memcpy((uint8_t*)&g_emt_app_info.fw_dl_info.magic_number, p_hci_msg->payload, p_hci_msg->payload_length);
			ret = emt_fw_upgrade_write_newfw_info(&g_emt_app_info.fw_dl_info);
			if(ret == EMT_SUCCESS)
			{
		#if defined(__MICOM_BOOTLOADER__)
		#else
				EMT_MSGQUEUE_T msg;
				msg.command = EMT_MSG_ENTER_FW_DOWNLOAD_MODE;
				msg.data_len = 0;
				osMessageQueuePut (appQueueHandle, &msg, 0, 0);
				p_hci_msg->type = EMT_HCI_TYPE_NONE;
		#endif
			}
			else
			{
				p_hci_msg->payload[0] = ret;
				p_hci_msg->payload_length = 1;
			}
		}
		break;
	case EMT_HCI_CID_NEW_FW_INFO:
		{
			EMT_HCI_FW_UPDATE_INFO *p_fw_update_info	= (EMT_HCI_FW_UPDATE_INFO*)p_hci_msg->payload;
			g_emt_app_info.fw_dl_info.version 			= p_fw_update_info->version;
			g_emt_app_info.fw_dl_info.image_size 		= p_fw_update_info->fw_size;
			g_emt_app_info.fw_dl_info.number_of_packets = p_fw_update_info->number_of_packets;
		}
		break;
	case EMT_HCI_CID_NEW_FW_PACKET:
		{
			EMT_MICOM_FWUP_STATUS_T status = FWUP_STATUS_ERROR;
			EMT_HCI_FW_PACKET_INFO *p_fw_packet_info;

			//static bool flag = true;
			static uint8_t count = 0;

			if(p_hci_msg->payload_length > 0)
			{
				p_fw_packet_info = (EMT_HCI_FW_PACKET_INFO*)p_hci_msg->payload;
				#if 0
				if((flag == false) && ((p_fw_packet_info->address % (1024*11)) == 0) && count > 3)
				{
					flag = true;
					count = 0;
				}
				else
				#endif
				if((g_fw_dl_status.address < g_emt_app_info.fw_dl_info.image_size) && (g_fw_dl_status.address == p_fw_packet_info->address))
				{
					int ret = EMT_FAILURE;
					ret = emt_fw_upgrade_write_newfw_area(g_fw_dl_status.address, p_fw_packet_info->packet_len, p_fw_packet_info->packets);
					if(ret != EMT_SUCCESS)
					{
						status = FWUP_STATUS_ERROR_FLASH_WRITE;
					}
					else
					{
						ret = emt_fw_upgrade_verify_newfw_area(g_fw_dl_status.address, p_fw_packet_info->packet_len, p_fw_packet_info->packets);
						if(ret != EMT_SUCCESS)
						{
							status = FWUP_STATUS_ERROR_VERIFY;
						}
						else
						{
							g_fw_dl_status.fw_packet_index++;
							g_fw_dl_status.address += p_fw_packet_info->packet_len;
							status = FWUP_STATUS_OK;
						}
					}
					//flag = false;
					count++;
				}

