CIYOON0909/micom_stm32_emt/Core/Src/emt_app.c
				p_hci_msg->payload_length = 1;
				p_hci_msg->payload[0] = status;
			}
		}
		break;
	case EMT_HCI_CID_NEW_FW_AREA_ERASE:
		{
			uint32_t address;
			EMT_MICOM_FWUP_STATUS_T status = FWUP_STATUS_ERROR;
			if(p_hci_msg->payload_length > 0)
			{
				memcpy((uint8_t*)&address, &p_hci_msg->payload[0], sizeof(uint32_t));
				ret = emt_fw_upgrade_erase_newfw_area(address);
				if(ret == EMT_SUCCESS)
				{
					g_fw_dl_status.address = address;
					status = FWUP_STATUS_OK;
				}
				else
				{
					status = FWUP_STATUS_ERROR_ERASE;
				}
				p_hci_msg->payload_length = 1;
				p_hci_msg->payload[0] = status;
			}
		}
		break;
	default:
		break;
	}
}

#if defined(ENABLE_HCI_GROUP_DIAGNOSTIC)
static void emt_app_cpu_hci_cmd_proc_diagnostic_group(EMT_HCI_PACKET_MSG *p_hci_msg)
{
	switch(p_hci_msg->cid)
	{
	case EMT_HCI_CID_DIAG_RESERVED1:
		break;
	default:
		break;
	}
}
#endif

void emt_app_cpu_hci_cmd_proc(EMT_HCI_PACKET_MSG *p_hci_msg)
{
	uint8_t cmd_type = 0;

	if(p_hci_msg == NULL)
		return;

	g_emt_app_info.bbx_communication_on = true;
	g_emt_app_info.bbx_receive_cmd_count++;

	switch(p_hci_msg->gid)
	{
	case EMT_HCI_GID_SYSTEM:
		{
			emt_app_cpu_hci_cmd_proc_system_group(p_hci_msg);
		}
		break;
#if defined(ENABLE_HCI_GROUP_PARKING)
	case EMT_HCI_GID_PARKING:
		{
			emt_app_cpu_hci_cmd_proc_parking_group(p_hci_msg);
		}
		break;
#endif
#if defined(ENABLE_HCI_GROUP_GPS)
	case EMT_HCI_GID_GPS:
		{
			emt_app_cpu_hci_cmd_proc_gps_group(p_hci_msg);
		}
		break;
#endif
#if defined(ENABLE_HCI_GROUP_ADC)
	case EMT_HCI_GID_ADC:
		{
			emt_app_cpu_hci_cmd_proc_adc_group(p_hci_msg);
		}
		break;
#endif
#if defined(ENABLE_HCI_GROUP_GSENSOR)
	case EMT_HCI_GID_GSENSOR:
		{
			emt_app_cpu_hci_cmd_proc_gsensor_group(p_hci_msg);
		}
		break;
#endif
#if defined(ENABLE_HCI_GROUP_LED)
	case EMT_HCI_GID_LED:
		{
			emt_app_cpu_hci_cmd_proc_led_group(p_hci_msg);
		}
		break;
#endif
#if defined(ENABLE_HCI_GROUP_RADAR)
	case EMT_HCI_GID_RADAR:
		{
			emt_app_cpu_hci_cmd_proc_radar_group(p_hci_msg);
		}
		break;
#endif
	case EMT_HCI_GID_FW_UPDATE:
		{
			emt_app_cpu_hci_cmd_proc_fw_update_group(p_hci_msg);
		}
		break;
#if defined(ENABLE_HCI_GROUP_DIAGNOSTIC)
	case EMT_HCI_GID_DIAGNOSTIC:
		{
			emt_app_cpu_hci_cmd_proc_diagnostic_group(p_hci_msg);
		}
		break;
#endif
	default:
		p_hci_msg->type = EMT_HCI_TYPE_NONE;
		break;
	}

	if(p_hci_msg->type == EMT_HCI_TYPE_CMD)
	{
		cmd_type = EMT_HCI_TYPE_RESP;
		emt_hci_send(p_hci_msg->src, cmd_type, p_hci_msg->gid, p_hci_msg->cid, p_hci_msg->payload, p_hci_msg->payload_length);
		if((p_hci_msg->gid == EMT_HCI_GID_SYSTEM) && (p_hci_msg->cid == EMT_HCI_CID_CPU_POWER_OFF))
		{
			HAL_Delay(10);
			g_emt_app_info.cpu_watchdog.mode = EMT_CPU_WATCHDOG_OFF;
		}
	}
}


EMT_SYSTEM_POWER_MODE emt_app_get_system_mode(void)
{
	return g_emt_app_info.bbx_op_mode;
}
